       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRCOB01.
      ***********************************
      * AREA DE COMENTARIOS
      * AUTHOR = ARTHUR ATH
      * OBJETIVO: MOSTRAR HELLO WORLD
      * DATA = 17/05/2021
      ***********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD!'.
           STOP RUN.
